{
  "my-sal-pack": {
    "title": "MySalPack",
    "thumbnail": "MSP-logo.svg",
    "id": "my-sal-pack",
    "role": "front-end developer",
    "year": "2023",
    "shortDesc": "Custom-built customer portal for salary packaging and novated leasing, offering secure access and account management.",
    "longDesc": [
      "A web portal built from the ground up - a fully customised customer portal for a leading company in the salary packaging and novated leasing industry. The portal provides clients with secure access to their salary packaging and novated leasing details.",
      "Built from scratch with custom designs, our team of dedicated developers ensured a seamless user experience and robust functionality. The portal empowers customers to conveniently manage their accounts, view transaction history, and access relevant documents, enhancing their overall experience with the company's services."
    ],
    "snapshot": [
      "my-sal-pack/msp-login-desktop.png",
      "my-sal-pack/msp-dashboard-loading-desktop.png",
      "my-sal-pack/msp-dashboard-desktop.png",
      "my-sal-pack/msp-benefits-desktop.png",
      "my-sal-pack/msp-claims-desktop.png",
      "my-sal-pack/msp-schedule-desktop.png",
      "my-sal-pack/msp-schedule-edit-desktop.png",
      "my-sal-pack/msp-2-factor-desktop.png"
    ],
    "snapshotMobile": [
      "my-sal-pack/msp-login-mobile.png",
      "my-sal-pack/msp-dashboard-mobile.png",
      "my-sal-pack/msp-benefits-1-mobile.png",
      "my-sal-pack/msp-benefits-2-mobile.png",
      "my-sal-pack/msp-menu-mobile.png"
    ],
    "stack": ["HTML", "CSS", "Sass", "JavaScript", "jQuery", "Blazor"]
  },
  "print-strategy-management": {
    "title": "Print Strategy Management",
    "thumbnail": "psmlogo.png",
    "id": "print-strategy-management",
    "role": "front-end developer",
    "year": "2019",
    "shortDesc": "Website built for a print client, showcasing products and enabling seamless online ordering.",
    "longDesc": [
      "Our team developed and designed a bespoke website for a prominent hard copy printing client. The website showcases their extensive range of print products and provides a seamless user experience for customers to explore and order their desired items.",
      "We incorporated a user-friendly interface, allowing visitors to easily navigate through various product categories and access detailed information. The result is a visually stunning and functional website that enhances the client's online presence and facilitates efficient print product transactions."
    ],
    "snapshot": [
      "print-strategy-management/psm-home.png",
      "print-strategy-management/psm-products.png",
      "print-strategy-management/psm-about.png"
    ],
    "snapshotMobile": [],
    "stack": ["HTML", "CSS", "WordPress", "jQuery"]
  },
  "kader-boot-co": {
    "title": "Kader Boot Co.",
    "thumbnail": "kader-boot-co.png",
    "id": "kader-boot-co",
    "role": "front-end developer",
    "year": "2019",
    "shortDesc": "Website showcasing premium leather boots with immersive design and seamless online shopping.",
    "longDesc": [
      "We created a bespoke WordPress website for a client specializing in premium leather boots. The website showcases their exquisite collection, featuring stunning product imagery and detailed descriptions.",
      "The site offers a unique seamless navigation of products and an intuitive interface, allowing customers to explore different boot styles and make purchases easily. Our custom design highlights the craftsmanship and luxury of the brand, providing an immersive online shopping experience for footwear enthusiasts."
    ],
    "snapshot": [
      "kader-boot-co/kader-home.png",
      "kader-boot-co/kader-shop.png",
      "kader-boot-co/kader-about.png"
    ],
    "snapshotMobile": [],
    "stack": ["HTML", "CSS", "WordPress", "jQuery"]
  },
  "annie-pirotta": {
    "title": "Annie Pirotta",
    "thumbnail": "annie-pirotta.png",
    "id": "annie-pirotta",
    "role": "front-end developer",
    "year": "2019",
    "shortDesc": "Custom-built website for musician Annie, featuring her digital products, courtesy of Bebble competition.",
    "longDesc": [
      "Annie, a talented musician, won a competition by held by Bebble and received a free custom website. The website showcases Annie's digital products and highlights her musical journey, providing a captivating online presence for her fans and customers."
    ],
    "snapshot": [
      "annie-pirotta/anniepirotta-home.png",
      "annie-pirotta/anniepirotta-sym.png"
    ],
    "snapshotMobile": [],
    "stack": ["HTML", "CSS", "WordPress", "jQuery"]
  },
  "my-blind-spots": {
    "title": "My Blind Spots",
    "thumbnail": "my-blind-spots.png",
    "id": "my-blind-spots",
    "role": "front-end developer",
    "year": "2019",
    "shortDesc": "Custom website for mental health, featuring a questionnaire to foster personal growth and improved relationships.",
    "longDesc": [
      "We created a custom website for a client in the mental health sector, providing a point of contact for her customers.",
      "The website features a simple questionnaire designed to outline personality types, aiming to prevent bad habits and foster stronger relationships. It serves as a valuable tool for personal growth and improved interpersonal connections."
    ],
    "snapshot": ["my-blind-spots/myblindspots-screen.png"],
    "snapshotMobile": [],
    "stack": ["HTML", "CSS", "WordPress", "jQuery"]
  },
  "boxti": {
    "title": "Boxti",
    "thumbnail": "boxtilogo.png",
    "id": "boxti",
    "role": "front-end developer",
    "year": "2018",
    "shortDesc": "Custom website selling curated product baskets via WordPress WooCommerce for seamless online shopping.",
    "longDesc": [
      "Boxti was a custom designed website developed from the ground up -  offering neatly packaged assortments of products. Built on WordPress with WooCommerce, the site provides a seamless e-commerce experience, allowing customers to easily browse, purchase, and enjoy the curated product baskets"
    ],
    "snapshot": [
      "boxti/boxti-home.png",
      "boxti/boxti-corporate.png",
      "boxti/boxti-about.png"
    ],
    "snapshotMobile": [],
    "stack": ["HTML", "CSS", "WordPress", "jQuery"]
  },
  "all-west-engineering": {
    "title": "All West Engineering",
    "thumbnail": "all-west-eng.png",
    "id": "all-west-engineering",
    "role": "front-end developer",
    "year": "2018",
    "shortDesc": "Developed learning management system for engineering solutions company, optimizing onboarding and training.",
    "longDesc": [
      "We created a robust learning management system for our client, a provider of engineering solutions. The system facilitates onboarding and training for new recruits, offering courses on various topics such as maintenance, line boring, and manufacturing.",
      "Through the system, the client effectively manages and tracks the progress of learners, ensuring a comprehensive and streamlined training experience."
    ],
    "snapshot": [
      "all-west-engineering/lms-1.png",
      "all-west-engineering/lms-2.png",
      "all-west-engineering/lms-3.png",
      "all-west-engineering/lms-4.png",
      "all-west-engineering/lms-5.png",
      "all-west-engineering/lms-6.png",
      "all-west-engineering/lms-admin-1.png",
      "all-west-engineering/lms-admin-2.png",
      "all-west-engineering/lms-admin-3.png",
      "all-west-engineering/lms-admin-4.png",
      "all-west-engineering/lms-admin-5.png",
      "all-west-engineering/lms-admin-6.png"
    ],
    "snapshotMobile": [],
    "stack": ["HTML", "CSS", "JavaScript", "jQuery"]
  },
  "perfect-cotton": {
    "title": "Perfect Cotton",
    "thumbnail": "perfectcottonlogo.png",
    "id": "perfect-cotton",
    "role": "front-end developer",
    "year": "2018",
    "shortDesc": "Simple and beautiful website selling decorative cotton sticks with a mint green color scheme.",
    "longDesc": [
      "We created a stunning website for our small business client specialising in decorative cotton sticks. With a focus on simplicity and beauty, the website features an elegant design, complemented by a mint green color scheme that aligns perfectly with the nature of the product.",
      "Visitors can explore the various cotton stick offerings and make purchases, immersing themselves in a visually appealing online shopping experience."
    ],
    "snapshot": [
      "perfect-cotton/perfectcotton-home.png",
      "perfect-cotton/perfectcotton-shop.png"
    ],
    "snapshotMobile": [],
    "stack": ["HTML", "CSS", "WordPress", "jQuery"]
  }
}
